Config/Catalogs/Resources.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Resources</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ResourceTypes</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DescriptionTranslations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoundTheClockOperation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServicePackage</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ServicePackages</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Calendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RackRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfPersonsPerResource</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateFolio</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Photo</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TimeFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TimeTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShowPrice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShowNumberOfPersonsPerResource</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoorLockSystemAuthorization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DoorLockSystemAuthorizations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBoardPlace</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullOccupancyHoursPerDay</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PreparationTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DisassembleTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ServicePackages</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ServicePackage</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ServicePackages</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>TableConfigurationsAllowed</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ResourceTableConfiguration</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ResourceTableConfigurations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PreparationTime</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DisassembleTime</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ResourceCharacteristics.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ResourceCharacteristics</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ResourceCharacteristicValue</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ResourceCharacteristicTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Resource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Resources</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ResourceCharacteristic</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ResourceCharacteristicTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/Calendars.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Calendars</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsPerPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Resources/Ext/ObjectModule.bsl
#Region EventHandlers

// --------------------------------------------------------------------------------
Procedure OnWrite(pCancel) 
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure // OnWrite

#EndRegion

#Region Public

// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	// Current hotel
	If Not ValueIsFilled(Hotel) Then
		Hotel = SessionParameters.CurrentHotel;
	EndIf;
	// Use round-the-clock calendar by default
	If Not ValueIsFilled(Calendar) Then
		Calendar = Catalogs.Calendars.RoundTheClock;
		RoundTheClockOperation = True;
	EndIf;
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
Function pmCheckResourceAttributes(pMessage, pAttributeInErr) Export
	vHasErrors = False;
	pMessage = "";
	pAttributeInErr = "";
	vMsgTextRu = "";
	vMsgTextEn = "";
	If IsBlankString(Code) Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Код> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Code> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Code", pAttributeInErr);
	EndIf;
	If IsBlankString(Description) Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Наименование> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Description> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Description", pAttributeInErr);
	EndIf;
	If Not ValueIsFilled(Owner) Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Тип ресурса> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Resource type> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Owner", pAttributeInErr);
	EndIf;
	If Not ValueIsFilled(Calendar) Then
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Календарь работы ресурса> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Resource working time calendar> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Calendar", pAttributeInErr);
	EndIf;
	If vHasErrors Then
		pMessage = "ru = '" + TrimAll(vMsgTextRu) + "';" + "en = '" + TrimAll(vMsgTextEn) + "';";
	EndIf;
	Return vHasErrors;
EndFunction // pmCheckResourceAttributes

// -----------------------------------------------------------------------------
Function pmGetResourceDescription(pLang) Export
	vDescr = "";
	If Not ValueIsFilled(pLang) Then
		vDescr = TrimAll(Description);
	Else
		If IsBlankString(DescriptionTranslations) Then
			vDescr = TrimAll(Description);
		Else
			vDescr = TrimAll(cmNStr(DescriptionTranslations, pLang));
		EndIf;
	EndIf;
	Return vDescr;
EndFunction // pmGetResourceDescription

// -----------------------------------------------------------------------------
// Get resource characteristics
// Returns ValueTable 
// -----------------------------------------------------------------------------
Function pmGetResourceCharacteristics() Export
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ResourceCharacteristics.Resource,
	|	ResourceCharacteristics.ResourceCharacteristic,
	|	ResourceCharacteristics.ResourceCharacteristicValue
	|FROM
	|	InformationRegister.ResourceCharacteristics AS ResourceCharacteristics
	|WHERE
	|	ResourceCharacteristics.Resource = &qResource AND
	|	ResourceCharacteristics.ResourceCharacteristic.DeletionMark = FALSE
	|ORDER BY
	|	ResourceCharacteristics.ResourceCharacteristic.Code";
	vQry.SetParameter("qResource", Ref);
	vChars = vQry.Execute().Unload();
	Return vChars;
EndFunction // pmGetResourceCharacteristics

// -----------------------------------------------------------------------------
// Get resource characteristic value
// Returns Value
// -----------------------------------------------------------------------------
Function pmGetResourceCharacteristicValue(pResourceCharacteristic) Export
	vCharValue = Undefined;
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ResourceCharacteristics.ResourceCharacteristicValue
	|FROM
	|	InformationRegister.ResourceCharacteristics AS ResourceCharacteristics
	|WHERE
	|	ResourceCharacteristics.Resource = &qResource AND
	|	ResourceCharacteristics.ResourceCharacteristic = &qResourceCharacteristic
	|ORDER BY
	|	ResourceCharacteristics.ResourceCharacteristic.Code";
	vQry.SetParameter("qResource", Ref);
	vQry.SetParameter("qResourceCharacteristic", pResourceCharacteristic);
	vChars = vQry.Execute().Select();
	While vChars.Next() Do
		vCharValue = vChars.ResourceCharacteristicValue;
		Break;
	EndDo;
	Return vCharValue;
EndFunction // pmGetResourceCharacteristicValue

// -----------------------------------------------------------------------------
Procedure pmSaveResourceCharacteristicValue(pResourceCharacteristic, pResourceCharacteristicValue) Export
	vResourceCharsMgr = InformationRegisters.ResourceCharacteristics.CreateRecordManager();
	vResourceCharsMgr.Resource = Ref;
	vResourceCharsMgr.ResourceCharacteristic = pResourceCharacteristic;
	vResourceCharsMgr.Read();
	If vResourceCharsMgr.Selected() Then
		vResourceCharsMgr.Resource = Ref;
		vResourceCharsMgr.ResourceCharacteristic = pResourceCharacteristic;
		vResourceCharsMgr.ResourceCharacteristicValue = pResourceCharacteristicValue;
		vResourceCharsMgr.Write();
	EndIf;
EndProcedure // pmSaveResourceCharacteristicValue

// -----------------------------------------------------------------------------
// Get resource children
// Returns ValueTable
// -----------------------------------------------------------------------------
Function pmGetResourceChildren() Export
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	Resources.Ref AS Resource
	|FROM
	|	Catalog.Resources AS Resources
	|WHERE
	|	Resources.Parent = &qResource
	|	AND (NOT Resources.DeletionMark)
	|ORDER BY
	|	Resources.SortCode";
	vQry.SetParameter("qResource", Ref);
	vChildren = vQry.Execute().Unload();
	Return vChildren;
EndFunction // pmGetResourceChildren

// -----------------------------------------------------------------------------
// Get resource default charging time
// Returns Structure with TimeFrom and TimeTo elements
// -----------------------------------------------------------------------------
Function pmGetResourceDefaultChargingTimes(pAccountingDate) Export
	// Check resource attributes
	If ValueIsFilled(TimeFrom) And ValueIsFilled(TimeTo) And TimeTo >= TimeFrom Then
		Return New Structure("TimeFrom, TimeTo", TimeFrom, TimeTo);
	EndIf;
	// Check calendar timetable
	If ValueIsFilled(Calendar) Then
		vCalendarObj = Calendar.GetObject();
		vDays = vCalendarObj.pmGetDays(BegOfDay(pAccountingDate), BegOfDay(pAccountingDate), , , Catalogs.RoomTypes.EmptyRef());
		If vDays.Count() > 0 Then
			vDaysRow = vDays.Get(0);
			vTimetable = vDaysRow.Timetable;
			If ValueIsFilled(vTimeTable) And vTimeTable.WorkingTimes.Count() > 0 Then
				vWorkingTimes = vTimeTable.WorkingTimes.Unload();
				vWorkingTimes.Sort("TimeFrom");
				vTimeFrom = vWorkingTimes.Get(0).TimeFrom;
				vTimeTo = vWorkingTimes.Get(vWorkingTimes.Count() - 1).TimeTo;
				If ValueIsFilled(vTimeFrom) And ValueIsFilled(vTimeTo) And vTimeTo >= vTimeFrom Then
					Return New Structure("TimeFrom, TimeTo", vTimeFrom, vTimeTo);
				EndIf;
			EndIf;
		EndIf;
	EndIf;
	Return New Structure("TimeFrom, TimeTo", '00010101', '00010101');
EndFunction // pmGetResourceDefaultChargingTimes

#EndRegion
